applications/solvers/cokeCombustionFoam/runs/base/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e6; //1 MPa

boundaryField
{
    "(inlet|outlet|fixedWalls)"
    {
      type            calculated;
      value           $internalField;
    }
  
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
