applications/solvers/cokeCombustionFoam/runs/base/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e6;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    // outlet
    // {
    //     type            prghTotalPressure;
    //     value           $internalField;
    //     p0              $internalField;
    // }

    outlet
    {
        type            fixedValue;
        value           $internalField;
    }

    fixedWalls
    {
        type            prghTotalPressure;
        p0              $internalField;
    }

    frontAndBack
    {
        type            empty;
    }
    
}

// ************************************************************************* //
