applications/solvers/cokeCombustionFoam/runs/base/constant/thermo.Solid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermo.Solid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

coke
{
    molWeight 12.0; // kg/kmol
    density   1110; //mass density, kg/m3
    kappa     0.27; //thermal conductivity, W/m/K
    cp        1000; //heat cpacity J/kg/K
}

rock
{
    molWeight 100; // kg/kmol, no meaningful
    density   2500; //mass density, kg/m3
    kappa     2.443; //thermal conductivity, W/m/K
    cp        723.5; //heat cpacity J/kg/K
}


// ************************************************************************* //
