applications/solvers/cokeCombustionFoam/runs/base/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          diagonal;
    }

    "coke.*"
    {
        solver          diagonal;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0.01;
    }

    // p_rgh
    // {
    //     solver          GAMG;
    //     smoother        DIC;
    //     tolerance       1e-6;
    //     relTol          0.01;
    //     maxIter          20;
    // }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-8;
        relTol          0;
    }

    // "(U|h|e|Y.*)"
    // {
    //     solver          PBiCGStab;
    //     preconditioner  DILU;
    //     tolerance       1e-6;
    //     relTol          0.01;
    // }

    // "(U|h|e|Y.*)Final"
    // {
    //     $U;
    //     tolerance       1e-8;
    //     relTol          0;
    // }

    "(h|e)"
    {
        // solver          PCG;
        // preconditioner  DIC;
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.01;
    }

    "(h|e)Final"
    {
        $h;
        tolerance       1e-8;
        relTol          0;
    }

    "(U|Y.*|O2|CO2)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.01;
    }

    "(U||Y.*|O2|CO2)Final"
    {
        $U;
        tolerance       1e-8;
        relTol          0;
    }

}

// PIMPLE
// {
//     nNonOrthogonalCorrectors 0;
//     nCorrectors         2;
// }

PIMPLE
{
    momentumPredictor yes;
    nNonOrthogonalCorrectors 0;
    nCorrectors       2;
    nOuterCorrectors  100;

    outerCorrectorResidualControl
    {
        "(h|e)"    
        {
            tolerance  1e-6;
            relTol     0;
        }

        "(Y.*|O2|CO2)"    
        {
            tolerance  1e-6;
            relTol     0;
        }

        p_rgh      
        {
            tolerance  5e-4;
            relTol     0;
        }
        
    }

    // p_rghRefCell          (2e-4 0 0); //the right bottome
    // p_rghRefValue         0;
}

relaxationFactors
{
    // fields
    // {
    //     p_rgh           0.7;
    // }
    equations
    {
        U               0.7;
        // ".*"            0.7;
    }
    
}

// relaxationFactors
// {
//     equations
//     {
//         ".*" 1;
//     }
// }


// relaxationFactors
// {
//     equations
//     {
//         "Y.*"            0.7;
//         "(h|e)"            0.7;
//     }
//     equations
//     {
//         "Y.*Final"            1.0;
//         "(h|e)Final"            1.0;
//     }
// }

// ************************************************************************* //
