applications/solvers/cokeCombustionFoam/runs/base/system/minMaxComponents
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out the minimum and maximum values, by component for non-scalar
    fields, and the locations where they occur.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/minMax/minMaxComponents.cfg"

fields (U p T coke);

// ************************************************************************* //
